; domain
( DEFINE ( DOMAIN DEPOT )
( :REQUIREMENTS :CONDITIONAL-EFFECTS :TYPING )
( :TYPES
	PLACE - OBJECT
	LOCATABLE - OBJECT
	DEPOT - PLACE
	DISTRIBUTOR - PLACE
	TRUCK - LOCATABLE
	HOIST - LOCATABLE
	SURFACE - LOCATABLE
	PALLET - SURFACE
	CRATE - SURFACE
)
( :PREDICATES
	( AT ?LOCATABLE0 - LOCATABLE ?PLACE1 - PLACE )
	( ON ?CRATE0 - CRATE ?SURFACE1 - SURFACE )
	( IN ?CRATE0 - CRATE ?TRUCK1 - TRUCK )
	( LIFTING ?HOIST0 - HOIST ?CRATE1 - CRATE )
	( AVAILABLE ?HOIST0 - HOIST )
	( CLEAR ?SURFACE0 - SURFACE )
	( EMPTYSTACK )
)
( :ACTION DO-DRIVE
  :PARAMETERS ( ?TRUCK0 - TRUCK ?PLACE1 - PLACE ?PLACE2 - PLACE )
  :PRECONDITION
	( AND
		( AT ?TRUCK0 ?PLACE1 )
		( EMPTYSTACK )
	)
  :EFFECT
	( AND
		( AT ?TRUCK0 ?PLACE2 )
		( NOT ( AT ?TRUCK0 ?PLACE1 ) )
	)
)
( :ACTION DO-LIFT
  :PARAMETERS ( ?HOIST0 - HOIST ?CRATE1 - CRATE ?SURFACE2 - SURFACE ?PLACE3 - PLACE )
  :PRECONDITION
	( AND
		( AVAILABLE ?HOIST0 )
		( AT ?CRATE1 ?PLACE3 )
		( ON ?CRATE1 ?SURFACE2 )
		( CLEAR ?CRATE1 )
		( AT ?HOIST0 ?PLACE3 )
		( EMPTYSTACK )
	)
  :EFFECT
	( AND
		( LIFTING ?HOIST0 ?CRATE1 )
		( CLEAR ?SURFACE2 )
		( NOT ( AT ?CRATE1 ?PLACE3 ) )
		( NOT ( CLEAR ?CRATE1 ) )
		( NOT ( AVAILABLE ?HOIST0 ) )
		( NOT ( ON ?CRATE1 ?SURFACE2 ) )
	)
)
( :ACTION DO-DROP
  :PARAMETERS ( ?HOIST0 - HOIST ?CRATE1 - CRATE ?SURFACE2 - SURFACE ?PLACE3 - PLACE )
  :PRECONDITION
	( AND
		( AT ?HOIST0 ?PLACE3 )
		( AT ?SURFACE2 ?PLACE3 )
		( CLEAR ?SURFACE2 )
		( LIFTING ?HOIST0 ?CRATE1 )
		( EMPTYSTACK )
	)
  :EFFECT
	( AND
		( AVAILABLE ?HOIST0 )
		( NOT ( LIFTING ?HOIST0 ?CRATE1 ) )
		( AT ?CRATE1 ?PLACE3 )
		( NOT ( CLEAR ?SURFACE2 ) )
		( CLEAR ?CRATE1 )
		( ON ?CRATE1 ?SURFACE2 )
	)
)
( :ACTION DO-LOAD
  :PARAMETERS ( ?HOIST0 - HOIST ?CRATE1 - CRATE ?TRUCK2 - TRUCK ?PLACE3 - PLACE )
  :PRECONDITION
	( AND
		( AT ?HOIST0 ?PLACE3 )
		( AT ?TRUCK2 ?PLACE3 )
		( LIFTING ?HOIST0 ?CRATE1 )
		( EMPTYSTACK )
	)
  :EFFECT
	( AND
		( NOT ( LIFTING ?HOIST0 ?CRATE1 ) )
		( IN ?CRATE1 ?TRUCK2 )
		( AVAILABLE ?HOIST0 )
	)
)
( :ACTION DO-UNLOAD
  :PARAMETERS ( ?HOIST0 - HOIST ?CRATE1 - CRATE ?TRUCK2 - TRUCK ?PLACE3 - PLACE )
  :PRECONDITION
	( AND
		( AVAILABLE ?HOIST0 )
		( IN ?CRATE1 ?TRUCK2 )
		( AT ?HOIST0 ?PLACE3 )
		( AT ?TRUCK2 ?PLACE3 )
		( EMPTYSTACK )
	)
  :EFFECT
	( AND
		( LIFTING ?HOIST0 ?CRATE1 )
		( NOT ( IN ?CRATE1 ?TRUCK2 ) )
		( NOT ( AVAILABLE ?HOIST0 ) )
	)
)
)

; problem
( DEFINE ( PROBLEM DEPOTPROB1818 )
( :DOMAIN DEPOT )
( :OBJECTS
	DEPOT0 - DEPOT
	DISTRIBUTOR0 DISTRIBUTOR1 - DISTRIBUTOR
	TRUCK0 TRUCK1 - TRUCK
	HOIST0 HOIST1 HOIST2 - HOIST
	PALLET0 PALLET1 PALLET2 - PALLET
	CRATE0 CRATE1 - CRATE
)
( :INIT
	( AT PALLET0 DEPOT0 )
	( CLEAR CRATE1 )
	( AT PALLET1 DISTRIBUTOR0 )
	( CLEAR CRATE0 )
	( AT PALLET2 DISTRIBUTOR1 )
	( CLEAR PALLET2 )
	( AT TRUCK0 DISTRIBUTOR1 )
	( AT TRUCK1 DEPOT0 )
	( AT HOIST0 DEPOT0 )
	( AVAILABLE HOIST0 )
	( AT HOIST1 DISTRIBUTOR0 )
	( AVAILABLE HOIST1 )
	( AT HOIST2 DISTRIBUTOR1 )
	( AVAILABLE HOIST2 )
	( AT CRATE0 DISTRIBUTOR0 )
	( ON CRATE0 PALLET1 )
	( AT CRATE1 DEPOT0 )
	( ON CRATE1 PALLET0 )
	( EMPTYSTACK )
)
( :GOAL
	( AND
		( ON CRATE0 PALLET2 )
		( ON CRATE1 PALLET1 )
		( EMPTYSTACK )
	)
)
)

; plan
1. (do-lift hoist0 crate1 pallet0 depot0)
   deleted: (at crate1 depot0) (clear crate1) (available hoist0) (on crate1 pallet0)
   added: (lifting hoist0 crate1) (clear pallet0)
   goals met: 1 of 3
2. (do-load hoist0 crate1 truck1 depot0)
   deleted: (lifting hoist0 crate1)
   added: (in crate1 truck1) (available hoist0)
   goals met: 1 of 3
3. (do-drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 1 of 3
4. (do-lift hoist1 crate0 pallet1 distributor0)
   deleted: (at crate0 distributor0) (clear crate0) (available hoist1) (on crate0 pallet1)
   added: (lifting hoist1 crate0) (clear pallet1)
   goals met: 1 of 3
5. (do-load hoist1 crate0 truck1 distributor0)
   deleted: (lifting hoist1 crate0)
   added: (in crate0 truck1) (available hoist1)
   goals met: 1 of 3
6. (do-unload hoist1 crate1 truck1 distributor0)
   deleted: (in crate1 truck1) (available hoist1)
   added: (lifting hoist1 crate1)
   goals met: 1 of 3
7. (do-drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 1 of 3
8. (do-unload hoist2 crate0 truck1 distributor1)
   deleted: (in crate0 truck1) (available hoist2)
   added: (lifting hoist2 crate0)
   goals met: 1 of 3
9. (do-drop hoist1 crate1 pallet1 distributor0)
   deleted: (lifting hoist1 crate1) (clear pallet1)
   added: (available hoist1) (at crate1 distributor0) (clear crate1) (on crate1 pallet1)
   goals met: 2 of 3
10. (do-drop hoist2 crate0 pallet2 distributor1)
   deleted: (lifting hoist2 crate0) (clear pallet2)
   added: (available hoist2) (at crate0 distributor1) (clear crate0) (on crate0 pallet2)
   goals met: 3 of 3
